#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cdn.azurerm_monitor_metric_alert.storage_account_low_availability will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnwalletcdnst01] Low Availability"
        name                = "[iopitnwalletcdnst01] Low Availability"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (8 unchanged attributes hidden)

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

        # (1 unchanged block hidden)
    }

  # module.cosmos.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-wallet-cosno-01] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01",
        ]
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "italynorth",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_support_response_time will be created
  + resource "azurerm_monitor_metric_alert" "function_app_support_response_time" {
      + auto_mitigate            = true
      + description              = "Slow responses from the Function App. Beware: deployments may slow it down for some minutes. Always check in application insight."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-wallet-supp-func-01] Slow Response Time"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HttpResponseTime"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.function_apps.azurerm_monitor_metric_alert.function_app_user_response_time will be created
  + resource "azurerm_monitor_metric_alert" "function_app_user_response_time" {
      + auto_mitigate            = true
      + description              = "Slow responses from the Function App. Beware: deployments may slow it down for some minutes. Always check in application insight."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-wallet-user-func-01] Slow Response Time"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-01",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HttpResponseTime"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
